vbirjuko/EFM32_ROMI_Robot/Maze.c
/*
 * Maze.c
 *
 *  Created on: 24 февр. 2019 г.
 *      Author: wl
 */
#include "spi_drv.h"
#include "configure.h"
#include "display.h"
#include "keyboard.h"
#include "LaunchPad.h"
#include "color_sensor.h"
#include "profiler.h"
#include "Logging.h"
#include "rand.h"
#include "crc.h"


void Search_Short_Way_with_turns(void);

#define MAX_PATH_LENGTH (sizeof(data.path)/sizeof(data.path[0]))
rotation_dir_t path[MAX_PATH_LENGTH];
int length[MAX_PATH_LENGTH];

map_cell_t map[MAX_MAP_SIZE];

const unsigned int turn_sequence[][3] = {
				{RIGHT_MASK, STRAIGHT_MASK, LEFT_MASK},
				{LEFT_MASK, STRAIGHT_MASK, RIGHT_MASK},
				{RIGHT_MASK, LEFT_MASK, STRAIGHT_MASK},
				{LEFT_MASK, RIGHT_MASK, STRAIGHT_MASK},
				{STRAIGHT_MASK, RIGHT_MASK, LEFT_MASK},
				{STRAIGHT_MASK, LEFT_MASK, RIGHT_MASK},
};

// This function decides which way to turn during the learning phase of
// maze solving.  It uses the variable available_directions which indicate
// whether there is an exit in each of the three directions. If no - turn back
rotation_dir_t SelectTurn(unsigned int available_directions, const unsigned int * sequence) {
    unsigned int  i;
    if (available_directions) {
        for (i = 0; i < 3; i++) {
            if (available_directions & sequence[i]) break;
        }
        switch (sequence[i]) {
            case STRAIGHT_MASK:
                return straight;
            case LEFT_MASK:
                return left;
            case RIGHT_MASK:
                return right;
            default:
                return back;
        }
    }
    return back;
}

void update_coordinate (coordinate_t *current_coordinate, unsigned int length, bearing_dir_t moving_direction) {
	switch (moving_direction) {
		case north:	current_coordinate->north += length;	break;
		case south:	current_coordinate->north -= length;	break;
		case east:	current_coordinate->east += length;		break;
		case west:	current_coordinate->east -= length;		break;
	}
}

unsigned int PlayMaze(void) {
    int step=0, cell_step;

    cell_step = (data.cell_step) ? data.cell_step : 100;
    if (data.pathlength == 0) return 1;

    data_log_init();
    while (put_command(command_wait | 2 * FRAMESCANPERSECOND)) continue;
    while (put_command(command_entrance | cell_step)) continue;

    while (step < data.pathlength) {
        while (put_command(data.length[step])) continue;
        step++;
    };
    while (put_command(command_finish)) continue;
    while (put_command(command_wait | 2 * FRAMESCANPERSECOND)) continue;
    while (profiler_queue_empty == 0) continue;
    profiler_data_ready = 0;
    data_log_finish();
    return 0;
}

void SpeedPlay(void) {
  squareXY(0, 0, 63, 127, 0);
  update_display();
  show_number(data.runnumber, 0);
  if (PlayMaze()) {
      putstr(0, 4, "No Route", 0);
      while (kbdread() != KEY_DOWN)continue;
  }
}

// The solveMaze() function works by applying a Luc-Tremo algorithm.
// Turn selection depends on strategy selected by variable data.lefthand
// (values from 0 to 5, otherwise uses random),
// excluding branches where robot already was checked.
unsigned int solveMaze(void) {
  unsigned int available, ii, next_segment_length = 0;
  unsigned int count_green, count_yellow, count_red,
               skiplevel,         // переменная выбора проходов: 0 - разворот,
                                  // 1 - зелёные - ни разу не посещенные,
                                  // 2 - желтые - посещенные один раз,
                                  // 3 - красные не выбираются - приехали.
               skippasscount = 0, // переменная запрещающая вносить изменения в поле passcount карты сразу
                                  // после окончания сгенерённого маршрута напрямик.
               play = 0;          // Переменная укзывающая сколько еще узлов надо проехать по сгенеренному маршруту
                                  //
  unsigned int last_index = 0, current_index, found_red = 0;
  unsigned int expect_index = UNKNOWN, turn_index;
  //    volatile unsigned int record_count = 0;
  rotation_dir_t   turn_direction = straight;
  int		move_direction = north, pathsequence;
  coordinate_t my_coordinate = {0, 0};
  unsigned int max_map_cell = 0;

  data_log_init();
  drop_command_queue();
  // Проезжаем вперед на половину корпуса вслепую
  put_command(command_wait | 2 * FRAMESCANPERSECOND);
  if (data.cell_step) put_command(command_entrance | data.cell_step);
  else                put_command(command_entrance | 150);
  put_command(command_forward | next_segment_length);
  {
      max_map_cell = 0;
      found_red = 0;
      last_index = 0;
      data.pathlength = 0;
      data.green_cell_nr = 0;
      data.red_cell_nr = 0;

      map[0].coordinate.north = my_coordinate.north;
      map[0].coordinate.east  = my_coordinate.east;
      map[0].pass_count[0] = 1;
      map[0].pass_count[1] = 4;
      map[0].pass_count[2] = 4;
      map[0].pass_count[3] = 4;
      map[0].node_link[0] = 0;
      map[0].node_link[1] = UNKNOWN;
      map[0].node_link[2] = UNKNOWN;
      map[0].node_link[3] = UNKNOWN;
      max_map_cell++;
  }

  do {
      // Navigate current line segment

      while (!profiler_data_ready) {
          if (profiler_error_code) {
              char err_code_str[] = "Error Code 0", last_idx_str[] = "Last_index =  0";
              squareXY(0,0, 127, 63, 1);
              update_display();
              err_code_str[11] = '0'+profiler_error_code;
              last_idx_str[14] = last_index % 10 + '0';
              last_idx_str[13] = (last_index / 10) ? (last_index / 10 + '0') : ' ';
              putstr(0, 3, "Profiler 1", 1);
              putstr(0, 4, err_code_str, 1);
              putstr(0, 5, last_idx_str, 1);
              profiler_error_code = 0;
              data_log_finish();
              return 1;
          }
          Rand();
          continue;
      }
      LaunchPad_Output(0);
      available = node_configuration;
      profiler_data_ready = 0;

      // если указана величина клетки, то подгоняем длину сегмента под этот шаг.
      if (data.cell_step) {
          segment_length = ((segment_length + data.cell_step/2) / data.cell_step) * data.cell_step;
          if (segment_length == 0) segment_length = data.cell_step;
      }
      update_coordinate(&my_coordinate, segment_length, (bearing_dir_t)move_direction);

