vbirjuko/EFM32_ROMI_Robot/Maze.c
  unsigned int k, min_index, destination;
  int	distance;
  int prev_bearing, bearing;

  fill_data32_dma(0xffffffff, (uint32_t*)path_length_table, data.map_size*2);
  data.pathlength = 0;

  spi_read_eeprom(ROM_map_addr, (uint8_t *)&map, sizeof(map));

  // переводим в двухслойную карту
  // однозначное соответствие: каждый узел делится на два n*2 и (n*2)+1
  // между ними сегмент длиной стоимостью поворота. К четным узлам примыкают
  // меридианальные сегменты - север/юг, к нечетным широтные - запад/восток.
  // каждый из этих сегментов удлинняется на стоимость прямого прохода узла.

  benchmark_start();
  while (dma_flag) continue; // ждём окончания fill_dma path_length[] <= 0xFFFFFFFF
  // Начинаем поиск с конца - стартовая точка финиш.
  // Причем, прибытие с любой стороны допустимо.
  path_length_table[data.red_cell_nr * 2] = 0;
  path_length_table[data.red_cell_nr * 2 + 1] = 0;

  sort_tail = 0;
  insert_val(0, data.red_cell_nr * 2);
  insert_val(0, data.red_cell_nr * 2 + 1);

  // Составляем карту высот по алгоритму Дейкстры
  while (sort_tail) {
      min_index  = extract_val();
      for (k = 0; k < 2; k++) {
          if ((destination = map[min_index/2].node_link[2*k + (min_index & 0x01)]) != UNKNOWN) {
              //                distance = map2d[min_index].length[k];
              distance =   (map[min_index/2].coordinate.north - map[destination].coordinate.north) +
                           (map[min_index/2].coordinate.east  - map[destination].coordinate.east);
              if (distance < 0) distance = -distance + data.crosscost;
              else              distance += data.crosscost;
              destination = destination * 2 + (min_index & 0x01);
              if (path_length_table[destination] > (path_length_table[min_index] + distance)) {
                  path_length_table[destination] = path_length_table[min_index] + distance;
                  insert_val(path_length_table[destination], destination);
              }
          }
      }
      distance = data.turncost;
      destination = min_index ^ 0x01;
      if (path_length_table[destination] > (path_length_table[min_index] + distance)) {
          path_length_table[destination] = path_length_table[min_index] + distance;
          if (insert_val(path_length_table[destination], destination)) LaunchPad_Output(RED);
      }
  }

  // таблица расстояний составлена - надо строить маршрут.
  // Теперь скатываемся вниз для создания кратчайшего пути
  // от старта к финишу.
  data.pathlength = 0; // указатель пути на начало
  for (unsigned int ii = north; ii <= west; ii++) {
      if (map[data.green_cell_nr].node_link[ii] != UNKNOWN) {
          prev_bearing = ii;
          min_index = (data.green_cell_nr << 1) | (ii & 0x01);
          break;
      }
  }

//  prev_bearing = north;
//  min_index = (data.green_cell_nr << 1);  // начинаем с того места где находимся и куда повернуты
//    if (path_length_table[min_index] > path_length_table[min_index+1]) {
//        min_index++;
//        prev_bearing = east;
//    }
  while (path_length_table[min_index]) {
      for (k = 0; k < 3; k++) {
          if (k < 2) {
              if ((destination = map[min_index/2].node_link[2*k + (min_index & 0x01)]) != UNKNOWN) {
                  distance =   (map[min_index/2].coordinate.north - map[destination].coordinate.north) +
                      (map[min_index/2].coordinate.east  - map[destination].coordinate.east);
                  if (distance < 0) distance = -distance;
                  // до этого destination был индекс в карте,
                  // а теперь будет индексом в таблице расстояний
                  destination = destination*2 + (min_index & 0x01);
                  if ((path_length_table[min_index] - distance) == (path_length_table[destination])) {
                      bearing = (bearing_dir_t)((min_index & 0x01) + 2*k);
                      if (bearing != prev_bearing) {
                          data.length[data.pathlength++] = (command_turn | ((bearing - prev_bearing) & TURN_MASK));
                      }
                      data.length[data.pathlength++] = (command_forward | distance);

                      prev_bearing = bearing;
                      min_index = destination;
                      break;
                  }
              }
          } else {
              if ((path_length_table[min_index] - data.turncost) == (path_length_table[min_index ^ 0x01])) {
                  min_index = min_index ^ 0x01;
                  break;
              }
          }
      }
  }
  return;
}

unsigned int search_way_simple(unsigned int start, unsigned int finish, bearing_dir_t my_bearing){
  unsigned int k, min_index, destination;
  int distance;
  bearing_dir_t prev_bearing, bearing;

  fill_data32_dma(0xffffffff, (uint32_t*)path_length_table, MAX_MAP_SIZE*2);
  while (dma_flag) continue; // ждём окончания fill_dma path_length[] <= 0xFFFFFFFF
  // Начинаем поиск с конца - стартовая точка финиш.
  // Причем, прибытие с любой стороны допустимо.
  // Хотя нет, надо бы передавать желательное направление... но пока пусть будет так.
  path_length_table[finish * 2] = 0;
  path_length_table[finish * 2 + 1] = 0;

  sort_tail = 0;
  insert_val(0, finish * 2);
  insert_val(0, finish * 2 + 1);

  // Составляем карту высот по алгоритму Дейкстры
  while (sort_tail) {
      min_index  = extract_val();
      for (k = 0; k < 2; k++) {
          if ((destination = map[min_index/2].node_link[2*k + (min_index & 0x01)]) != UNKNOWN) {
              //                distance = map2d[min_index].length[k];
              distance =   (map[min_index/2].coordinate.north - map[destination].coordinate.north) +
                  (map[min_index/2].coordinate.east  - map[destination].coordinate.east);
              if (distance < 0) distance = -distance;
              // до этого destination был индекс в карте,
              // а теперь будет индексом в таблице расстояний
              destination = destination * 2 + (min_index & 0x01);
              if (path_length_table[destination] > (path_length_table[min_index] + distance)) {
                  path_length_table[destination] = path_length_table[min_index] + distance;
                  insert_val(path_length_table[destination], destination);
              }
          }
      }

      distance = data.turncost;
      destination = min_index ^ 0x01;
      if (path_length_table[destination] > (path_length_table[min_index] + distance)) {
          path_length_table[destination] = path_length_table[min_index] + distance;
          if (insert_val(path_length_table[destination], destination)) LaunchPad_Output(RED);
      }
  }
  // таблица расстояний составлена - надо строить маршрут.
  // Теперь скатываемся вниз для создания кратчайшего пути
  // от старта к финишу.
  data.pathlength = 0; // указатель пути на начало
  prev_bearing = my_bearing;
  min_index = (start << 1) | (my_bearing & 0x01);  // начинаем с того места где находимся и куда повернуты
  //  if (path_length_table[min_index] > path_length_table[min_index+1]) {
  //      min_index++;
  //      prev_bearing = east;
  //  }

  while (path_length_table[min_index]) {
      for (k = 0; k < 3; k++) {
          if (k < 2) {
              if ((destination = map[min_index/2].node_link[2*k + (min_index & 0x01)]) != UNKNOWN) {
                  distance =   (map[min_index/2].coordinate.north - map[destination].coordinate.north) +
                      (map[min_index/2].coordinate.east  - map[destination].coordinate.east);
                  if (distance < 0) distance = -distance;
                  // до этого destination был индекс в карте,
                  // а теперь будет индексом в таблице расстояний
                  destination = destination*2 + (min_index & 0x01);
                  if ((path_length_table[min_index] - distance) == (path_length_table[destination])) {
                      bearing = (bearing_dir_t)((min_index & 0x01) + 2*k);
                      if (bearing != prev_bearing) {
                          length[data.pathlength++] = (command_turn | ((bearing - prev_bearing) & TURN_MASK));
                      }
                      length[data.pathlength++] = (command_forward | distance);

                      prev_bearing = bearing;
                      min_index = destination;
                      break;
                  }
              }
          } else {
              if ((path_length_table[min_index] - data.turncost) == (path_length_table[min_index ^ 0x01])) {
                  min_index = min_index ^ 0x01;
                  break;
              }
          }
      }
  }
  return 0;
}

void Explore_Maze(void) {
  squareXY(0, 0, 127, 63, 0);
  update_display();
  if (data.runnumber) {
      show_number(data.runnumber, 0);
  }
  if (solveMaze()) {
      while (kbdread() != KEY_DOWN);
  }

}

void DrawMap(void) {
  spi_read_eeprom(ROM_map_addr, (uint8_t *)&map, sizeof(map));
  Draw_Map();
  while(kbdread() != KEY_DOWN) continue;
}

void SearchShortWay(void) {
  Search_Short_Way_with_turns();
  Draw_Map();
  data.crc32 = calc_crc32((uint8_t*)&data, sizeof(data)-4);
  spi_write_eeprom(EEPROM_COPY_ADDRESS, (uint8_t *)&data, sizeof(data));
  spi_write_eeprom(EEPROM_CONFIG_ADDRESS, (uint8_t *)&data, sizeof(data));
  while(kbdread() != KEY_DOWN) continue;
}
